# Data Wrangling with pandas
## data filtering
## data normalization

In [257]:
import pandas as pd
import numpy as np
import seaborn as sns

In [258]:
kashti=sns.load_dataset("titanic")

In [259]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [260]:
# simple mathematic operation
#(kashti["age"]+1).head()

In [261]:
kashti.shape

(891, 15)

In [262]:
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [263]:
# drop na from deck column inplace =true mean value modified and don't returen anything and 
# inplace= false mean values modified and return the values mean it will show output
#kashti.drop(["deck"],axis=1) # this function will remove the entire column axis=1 means columns
kashti.dropna(subset=["deck"],axis=0,inplace=True) # this function remove or drop null rows axis=0 means rows

In [264]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [265]:
kashti.shape

(203, 15)

In [266]:
# drop na from entire dataset
clean=kashti.dropna()
clean.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [267]:
clean.shape

(182, 15)

In [268]:
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [269]:
# replacing na with mean of the age column
# kashti["age"]=kashti["age"].replace(np.nan,np.mean)
# kashti.isnull().sum()

In [270]:
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [271]:
# convert data type from one to another
kashti["survived"]=kashti["survived"].astype("float") # we convert survived from int to float
# kashti["survived"].astype("float") # you can also do this

In [272]:
kashti.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [273]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [274]:
clean["age"]=clean["age"].astype("int")

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [275]:
clean.dtypes

survived          int64
pclass            int64
sex              object
age               int32
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [276]:
# age in days
clean["age"]=clean["age"]*365
clean.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [277]:
# convert the column name age into age in days
clean.rename(columns={"age":"age in days"},inplace=True)
clean.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\pandas\core\frame.py:4025: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

## methods of data normalization
1. simple featue scaling 
- x(new)=x(old)/x(max)
2. Min-max method
3. Z-score (standard score) -3 to +3
4. log tranformation

In [278]:
nd=clean[["age in days","fare"]]
nd.head()

    age in days     fare
1         13870  71.2833
3         12775  53.1000
6         19710  51.8625
10         1460  16.7000
11        21170  26.5500

- the above data is really in wide range and we need to normalize it is hard to compare
- notmalization change the values to the range 0 to 1 ( now both has similar influence on our models)

In [279]:
# first method (simple featue scaling) 
nd["fare"]=nd["fare"]/nd["fare"].max()
nd["age in days"]=nd["age in days"]/nd["age in days"].max()
nd.head()

# here you can see all the numbers are in between 0 and 1

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [280]:
# second method (Min-max method)
nd["fare"]=(nd["fare"]-nd["fare"].mean())/nd["fare"].std()
nd["age in days"]=(nd["age in days"]-nd["age in days"].mean())/nd["age in days"].std()
nd.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

    age in days      fare
1      0.152413 -0.099835
3     -0.038892 -0.337554
6      1.172704 -0.353732
10    -2.015706 -0.813428
11     1.427777 -0.684654

In [281]:
# third method (log tranformation)
nd["fare"]=np.log(nd["fare"])
nd.head() # the data is too low tha't why it gives us NaN if we do the following

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in log

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    age in days  fare
1      0.152413   NaN
3     -0.038892   NaN
6      1.172704   NaN
10    -2.015706   NaN
11     1.427777   NaN

In [282]:
data=sns.load_dataset("titanic")
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [283]:
data["fare"]=np.log(data["fare"])
data.head() # now you can check the fare vlaue

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log
  """Entry point for launching an IPython kernel.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True

# bins
- group of data such as age 10 -20 , 21-30 and so on called bins

In [284]:
# bins=np.linspace(min(data["age"]),max(data["age"]),15000)
# age_groups=["bachy","jawan","boray" ]
# data['age']=pd.cut(data["age"], bins, labels=age_groups, include_lowest=True)
# data["age"]

In [288]:
# convert the sex columns into dummies mean from male (male= 1 and female =0 when true then 1 false 0 )
# you can see there is no change in the data set 
pd.get_dummies(data["sex"])
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,0,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,1,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,1,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,0,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True

In [289]:
# change in the dataset
data["sex"]=pd.get_dummies(data["sex"])
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,0,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,0,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,0,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,1,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True